app/controllers/gigs_controller.rb

SELECT "gigs".* FROM "gigs" WHERE "gigs"."user_id" = 1 LIMIT 1
---
  def index
    if current_user
      @gigs = Gig.where(:user_id => current_user.id)

INSERT INTO "gigs" ("address", "city", "contact_email", "contact_name", "contact_phone", "created_at", "day", "month", "title", "total_budget", "updated_at", "user_id", "venue", "year", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @gig = Gig.new(params[:gig])
    @gig.month = params["date"]["month"].to_i
    @gig.day = params["date"]["day"].to_i
    @gig.year = params["date"]["year"].to_i
    if params["time"]
      @gig.time = Time.new(params["date"]["year"], params["date"]["month"], params["date"]["day"], params["time"]["time(4i)"], params["time"]["time(5i)"])
    end
    logger.info @gig.month

    if params[:contact]
      @contact = Contact.new(params[:contact])
      @contact.user_id = current_user.id
    end

    if @contact.save && @gig.save

SELECT "gigs".* FROM "gigs" WHERE "gigs"."id" = ? LIMIT 1  [["id", "23"]]
---
  def show
    @gig = Gig.find(params[:id])

SELECT "gigs".* FROM "gigs" WHERE "gigs"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @gig = Gig.find(params[:id])

SELECT "gigs".* FROM "gigs" WHERE "gigs"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "gigs" SET "title" = 'Better Title', "contact_name" = '', "contact_phone" = '', "contact_email" = '', "venue" = '', "city" = '', "address" = '', "user_id" = NULL, "updated_at" = '2013-03-16 02:44:56.711406' WHERE "gigs"."id" = 1
---
  def update
    @gig = Gig.find(params[:id])
    @contact = @gig.contacts.first
    @user_id = current_user.id
    if @gig.update_attributes(params[:gig])

SELECT "gigs".* FROM "gigs" WHERE "gigs"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "gigs" WHERE "gigs"."id" = ?  [["id", 3]]
---
  def destroy
    @gig = Gig.find(params[:id])
    @gig.destroy